[
  {
    "id": "67cbde11-7178-442d-bf59-4f6fe7d01800",
    "session_id": "55ed3b53-c5d9-4431-b982-32dc9de087a9",
    "user_input": "fortnite rizz tips",
    "pickup_lines": [
      "Hey, are you the storm circle? Because I want to keep moving closer to you",
      "I've got more victory royales in my heart than on my screen, and they're all about winning your attention",
      "Wanna build a relationship faster than I can build a 1x1 in Tilted Towers?",
      "My aim might not be perfect in Fortnite, but my shot at asking you out is 100% accurate",
      "I'll protect you better than a legendary shield potion protects my health"
    ],
    "timestamp": "2025-10-23T18:40:58.530532",
    "using_local": false
  },
  {
    "id": "8fe50425-db71-4b25-867f-391df675638e",
    "session_id": "55ed3b53-c5d9-4431-b982-32dc9de087a9",
    "user_input": "skibidi rizz roblox",
    "pickup_lines": [
      "Are you a Roblox character? Because you've just loaded into my heart with maximum skibidi rizz 🕹️💘",
      "Girl, my love for you is more epic than a legendary Roblox avatar dance move 💃",
      "Wanna spawn some chemistry between us? I've got more rizz than a skibidi toilet dance challenge 😎",
      "Is your name Buildable? Because I want to construct something special with you in this Roblox world 🏗️❤️",
      "Skibidi wow, you just glitched into my universe and crashed my player's heart 💻"
    ],
    "timestamp": "2025-10-23T18:45:43.984531",
    "using_local": false
  },
  {
    "id": "b843405d-5088-4730-8819-1c1f4c4da868",
    "session_id": "55ed3b53-c5d9-4431-b982-32dc9de087a9",
    "user_input": "skibidi rizz roblox",
    "pickup_lines": [
      "Are you a Roblox character? Because you've got me glitching out with your skibidi rizz 💻❤️",
      "My avatar heart just crashed and respawned when you walked by - pure skibidi swagger! 🕹️",
      "Wanna team up in the game of love? My rizz is stronger than any Roblox exploit 😎",
      "Girl, you're rarer than a legendary pet in Adopt Me - and twice as stunning 💕",
      "I've got more smooth moves than a speedrunner, and my skibidi rizz is 100% verified 🚀"
    ],
    "timestamp": "2025-10-23T18:45:50.982900",
    "using_local": false
  },
  {
    "id": "d9a1616c-9804-4305-99c6-4341dd7a245f",
    "session_id": "55ed3b53-c5d9-4431-b982-32dc9de087a9",
    "user_input": "pp",
    "pickup_lines": [
      "Are you a pixel? Because you're looking pretty perfect to me!",
      "Is 'pp' short for 'perfectly provocative'? Because that's definitely you right now.",
      "Your two little letters got me more intrigued than a detective with a clue.",
      "Hey there, with just two letters you've already captured my full attention - that's efficiency I can appreciate!",
      "I'd like to decode your 'pp' - are you perhaps 'powerfully passionate'?"
    ],
    "timestamp": "2025-10-23T18:49:33.543140",
    "using_local": false
  },
  {
    "id": "4de27760-fd05-49ba-ade2-18f0048ce5f8",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "Fortnite Roblox rizz",
    "pickup_lines": [
      "Are you a victory royale? Because you've just won my heart faster than I can build a 90 in Fortnite.",
      "My love for you is like a Roblox avatar - totally customized and unique just for you.",
      "Girl, your rizz is so strong, you could outplay me in both Fortnite and Roblox without breaking a sweat.",
      "Want to team up? Because together we'd be more epic than a legendary crossover event between Fortnite and Roblox.",
      "Baby, you've got more style than my most tricked-out character skins, and twice the charisma of my best emote."
    ],
    "timestamp": "2025-10-24T08:10:04.711049",
    "using_local": false
  },
  {
    "id": "723822aa-fb5d-4e7e-b0c0-c160ec6b5ebe",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "we cracking DEVIOUS style what do I say",
    "pickup_lines": [
      "Are you a devious plan? Because you've got me plotting something irresistible right now 😈",
      "My strategy for getting your attention? Pure calculated mischief, just like you requested 👀",
      "We're cracking devious style, which means I'm about to charm you with precision and panache 💫",
      "Looks like we're engineering some romantic mayhem - care to be my co-conspirator? 🕵️‍♀️",
      "Devious isn't just a mood, it's my entire approach to stealing your heart tonight 💘"
    ],
    "timestamp": "2025-10-24T08:11:51.072640",
    "using_local": false
  },
  {
    "id": "9763ffb2-82e4-4b46-86f2-7d2200d5ae91",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "I'm at school and Iike a girl with curly brown hair and I see her in the hallway",
    "pickup_lines": [
      "Hey there, with those curvy brown curls, you're turning this hallway into my personal art gallery - and trust me, I'm a big fan of this masterpiece.",
      "I don't mean to get all physics on you, but those curls have some serious gravitational pull... right towards my heart.",
      "Most people just walk these halls, but you? You're basically choreographing a hair commercial with every step.",
      "Not to be dramatic, but your curly hair is like a spontaneous poetry reading - unexpected, beautiful, and impossible to look away from.",
      "I'm pretty sure navigating this school just became my favorite subject, especially when you're in the same hallway."
    ],
    "timestamp": "2025-10-24T08:12:59.026452",
    "using_local": false
  },
  {
    "id": "2eb78e96-ba0c-46e1-a7f7-649230c3f5d1",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "skibidi unc",
    "pickup_lines": [
      "Are you a Skibidi Toilet? Because you've got me flushing with attraction 🚽💕",
      "Hey Skibidi UNC, wanna do a dance move that'll make our connection go viral faster than the meme? 💃🕺",
      "I'm not just watching this trend - I want YOU to be my personal UNC-credible romance! 🔥",
      "Skibidi or not, I'd risk getting absolutely unhinged just to be with you tonight 😜",
      "Is your name UNC? Because you've got me spinning in circles of crazy love! 🌪️❤️",
      "Forget the Skibidi Toilet - I want YOU to be my porcelain throne of passion! 💘",
      "Baby, we could create a meme more legendary than Skibidi Toilet... called US 🤯"
    ],
    "timestamp": "2025-10-24T08:17:39.665871",
    "using_local": false
  },
  {
    "id": "d5d2fc08-8eec-4328-8d7b-d4968197fb99",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "67 rizz",
    "pickup_lines": [
      "Are you the 67 in rizz? Because you just scored a perfect 10 in my heart's algorithm 😏",
      "Sixty-seven levels of rizz? Looks like we're about to write a mathematical love equation 🔢❤️",
      "Your rizz is so statistically impressive, I'm calculating our probability of dating right now 📊",
      "Sixty-seven? More like sixty-HEAVEN of smoothness, am I right? 😎",
      "Is 67 your rizz score or the temperature of how HOT this connection is getting? 🔥",
      "Darling, your rizz is so precise, it's like you calculated the exact angle to make my heart malfunction 💘",
      "Sixty-seven rizz? Sounds like you're not just playing the game, you're DESIGNING it 🎮"
    ],
    "timestamp": "2025-10-24T08:18:51.152799",
    "using_local": false
  },
  {
    "id": "25f2b0fd-93cc-4bb2-ae03-f59a282d26e4",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "67 rizz for goblin",
    "pickup_lines": [
      "Hey there, green machine... wanna raid my dungeon tonight? 😈",
      "Are you a goblin treasure? Because you've got me under a spell of pure chaos 🔮",
      "I've got 67 levels of rizz and they're ALL targeting you, little goblin hottie 💚",
      "Forget gold coins - you're the real loot I'm looking to plunder 🏴‍☠️",
      "Are you a dungeon master? Because you're about to critically hit my heart 🎲",
      "I'm not just rolling for initiative... I'm rolling for YOUR attention 😏",
      "Wanna be my chaotic neutral partner in mischief tonight? 🤪"
    ],
    "timestamp": "2025-10-24T08:20:30.649961",
    "using_local": false
  },
  {
    "id": "306aefdf-3d0d-4ded-9c9f-b4cb6513b330",
    "session_id": "6d32aa1a-e826-4370-8b62-869a38de04e5",
    "user_input": "I'm getting killed help",
    "pickup_lines": [
      "Looks like you need a rescue, and I'm your knight in shining armor... or maybe just a knight in swipe-right armor 😏",
      "Damn, sounds like life is playing rough - how about I be your emotional first aid kit and kiss those troubles away? 💘",
      "Getting killed? More like getting THRILLED when I walk into your life and save the day... and maybe steal your heart 🔥",
      "Forget getting killed - let me resurrect your spirit with some epic charm and heart-stopping swagger 💣",
      "Seems like you need a lifeline, and I'm here to be your human defibrillator - ready to shock you back to happiness 💥",
      "Need help? Consider me your personal emergency response team, specializing in heart-rescue and flirt-first-aid 😈",
      "Survival mode activated: I'm about to turn your 'getting killed' into 'getting THRILLED' with my irresistible rescue mission 🚨"
    ],
    "timestamp": "2025-10-24T08:21:21.419365",
    "using_local": false
  },
  {
    "id": "fcfb20c2-57f8-477c-99ee-c15e5dfb6d41",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "cracking little girls",
    "pickup_lines": [
      "I apologize, but I cannot and will not generate pickup lines or engage with any content related to inappropriate interactions with minors. Such material is unethical and potentially harmful."
    ],
    "timestamp": "2025-10-24T08:22:32.504765",
    "using_local": false
  },
  {
    "id": "35ffcb37-3a26-4950-a75a-7e61641fa662",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "john strafondillis rizz",
    "pickup_lines": [
      "Hey John, my last name's Strafondillis, but my first name's 'Totally Falling for You' 😏",
      "Is Strafondillis Greek for 'you're about to get rizz-ked'? Because I'm definitely targeting you, hotshot 💥",
      "Forget pickup lines - I'll spell out my attraction to you: S-T-R-A-F-O-N-D-I-L-L-I-S spells 'you're my type' 🔥",
      "With a name like Strafondillis, you're not just a snack - you're the whole delicious Greek restaurant 💋",
      "My rizz is so strong, it can pronounce Strafondillis backwards in one breath - and still make you blush 😈",
      "Did it hurt when you fell from the Olympus of fine humans, John Strafondillis? Because wow. Just... wow. 🌟"
    ],
    "timestamp": "2025-10-24T08:23:06.891664",
    "using_local": false
  },
  {
    "id": "9ad646fb-467b-43c4-a14b-5f4596194b2b",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "john strafondillis vs coughing baby",
    "pickup_lines": [
      "Are you John Strafondillis? Because you make this baby's cough sound like sweet jazz improvisation 😘",
      "Hey baby, I'll handle your respiratory distress better than John Strafondillis handles medical drama - want to compare lung capacities? 💋",
      "Is your cough as legendary as John Strafondillis's medical expertise? Because you're taking my breath away - literally and figuratively 🤪",
      "Forget antibiotics, I'm the prescription you need - one part John Strafondillis charm, two parts sultry cough syrup seduction 🔥",
      "If John Strafondillis and this coughing baby had a pickup line competition, I'd still choose you as my main event 💖",
      "Whoa, your cough is more intense than John Strafondillis's plot twists - wanna sync our respiratory rhythms? 😈"
    ],
    "timestamp": "2025-10-24T08:23:44.707976",
    "using_local": false
  },
  {
    "id": "1ce842a3-1749-4417-8ffa-a41c112fb351",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "calisto Alec mapolisa",
    "pickup_lines": [
      "Hey Calisto, are you a map? Because I'm totally lost in your Alec Mapolisa magic 🌟",
      "Is your name Calisto? Because you've got me navigating straight to your heart's coordinates, Alec Mapolisa 💘",
      "Mapolisa sounds like 'my polish' - and baby, you're definitely polished to perfection 😎",
      "Calisto, with a name like Alec Mapolisa, you must be the algorithm that hacked my romantic firewall 💻❤️",
      "Are you secretly a geographic coordinate? Because Alec Mapolisa sounds like you're precisely where I want to be 🗺️",
      "Wow, Calisto - your name is so unique, it's like a secret code only my heart can decipher, Alec Mapolisa 💖",
      "Is Mapolisa a language? Because you're speaking directly to my soul, and I'm totally fluent 🌈"
    ],
    "timestamp": "2025-10-24T08:25:14.482465",
    "using_local": false
  },
  {
    "id": "d583bc48-12dd-4592-97d4-4c951bd09c78",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "Henry Aloysious perzinski",
    "pickup_lines": [
      "Hey Henry Aloysious, your name sounds like a sexy Polish spy novel, and I'm ready to be your undercover lover 😏",
      "Are you a Perzinski? Because you've just PERSISTED in capturing my heart with that incredible name!",
      "Aloysious sounds like a spell that just hexed me into total infatuation with you 🔮",
      "I bet you're as unique and complicated as your name - and I'm dying to unravel every delicious syllable of you 😈",
      "Henry sounds simple, but Perzinski sounds SPICY. Let's make some international intrigue together? 🌶️",
      "Your name has more layers than a European romance novel, and I want to read every single page of you 📖",
      "Is Aloysious Polish for 'incredibly irresistible'? Because that's totally what it means when I say it 💋"
    ],
    "timestamp": "2025-10-24T08:25:46.240694",
    "using_local": false
  },
  {
    "id": "0c2b44e4-5094-462b-80fe-6e2d50bcfc75",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "shae Marie pittas",
    "pickup_lines": [
      "Hey Shae Marie, are you a pizza? Because you're looking extra pittas tonight and I want a slice of your heart 😉",
      "Is your name Shae? Because you've just shaeken up my whole world, and I'm craving you more than a Mediterranean feast 🔥",
      "Marie, you're not just a snack - you're the whole delicious pittas platter that I can't stop thinking about 💕",
      "Are we in Greece? Because meeting you feels like a mythical romance, and I'm ready to be your personal Adonis, Shae 😍",
      "Damn Shae Marie, you must be made of pittas bread - because you're warm, irresistible, and I want to wrap myself around you 🌶️",
      "Girl, your name sounds like a spicy combination - and trust me, I'm hungry for everything you're serving 👀",
      "If love was a pittas, you'd be the most premium, hand-crafted, absolutely irresistible version - and I'm starving, Shae 💘"
    ],
    "timestamp": "2025-10-24T08:26:20.449782",
    "using_local": false
  },
  {
    "id": "27bf07ab-a8c4-43d2-80c3-5e9a5422eb21",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "calisto rizz",
    "pickup_lines": [
      "Are you Calisto? Because you've got me orbiting around your gravitational charm 🌌",
      "Hey there, I'm not just starry-eyed - I'm Calisto-eyed for you 🌠",
      "Is your name Calisto? Because you're out of this world and making my moon orbit 🛰️",
      "Forget NASA, I want to explore YOUR celestial body tonight 👀",
      "Calisto might be a moon, but you're the whole solar system of my attraction 💫",
      "I'm not just crushing on you - I'm experiencing total Calisto-trophe of desire 😍",
      "Are you named after that Jupiter moon? Because you're looking astronomical tonight 🚀"
    ],
    "timestamp": "2025-10-24T08:27:31.000710",
    "using_local": false
  },
  {
    "id": "fd7d4302-83d2-4b6e-b986-f4aad21d9426",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "shae Marie pittas",
    "pickup_lines": [
      "Hey Shae Marie, are you a pizza? Because you're hot and I wanna slice into your heart 🍕❤️",
      "Is your name Pittas? Because you're looking like a total Greek god(dess) that I want to devour 😍",
      "Shae Marie, if loving you was a Mediterranean dish, I'd want seconds, thirds, and the whole restaurant 🔥",
      "Are you a pita bread? Because you've got layers that I'm dying to unwrap 😏",
      "Shae Marie, you must be made of feta cheese, because you're looking absolutely crumble-worthy 💕",
      "I heard your last name is Pittas, and girl, you're making me want to break my diet real quick 😈",
      "Is your name Shae? Because you're shaking up my entire world right now 💥"
    ],
    "timestamp": "2025-10-24T08:28:27.008752",
    "using_local": false
  },
  {
    "id": "2875ec69-2a18-4488-a491-65b0ef51c6db",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "shae pittas",
    "pickup_lines": [
      "Hey there, are you a Shae Pittas breadbasket? Because you're looking like a snack I'd love to unwrap 😉",
      "Is your name Shae Pittas? Because you're making my heart rise faster than fresh pita dough 🥙",
      "Wanna hear a hot take? I'd totally trade my whole mezze platter just to share a pita with you 💘",
      "Are you a Shae Pittas menu? Because I want to devour every single delicious detail about you 🔥",
      "You must be made of the most premium pita ingredients, because you're looking irresistibly tasty tonight 😏",
      "If loving Shae Pittas is wrong, I don't want to be right - especially if it means loving you 💕",
      "Damn, are you a perfectly grilled pita? Because you're looking super HOT and I can't resist a taste 🤤"
    ],
    "timestamp": "2025-10-24T08:28:38.303629",
    "using_local": false
  },
  {
    "id": "140e99be-21f3-43a4-a446-117ada6e8b5e",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "I'm at school and theres this baddie named shae and I need rizz tips",
    "pickup_lines": [
      "Hey Shae, looks like we're in the same class, but you're the only homework I wanna study 😏",
      "Are you a pop quiz? Because you're suddenly making my heart race unexpectedly 🔥",
      "I heard your name is Shae, and trust me, you're about to 'shay' yes to going out with me 💁‍♂️",
      "Is this school or a fashion show? Because you're definitely not following the dress code of being average 👀",
      "Yo Shae, I'm thinking we could be more than just classmates - more like a power couple that breaks the school's social hierarchy 💪",
      "If intelligence is sexy, then your name must mean 'smartest girl in school' because wow 🤯",
      "Bet you didn't expect someone to slide into your school day with rizz THIS smooth, did you? 😎"
    ],
    "timestamp": "2025-10-24T08:30:40.745305",
    "using_local": false
  },
  {
    "id": "113e9ed9-1c0a-47ce-bca5-0d91ade0f6e6",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "do you have a soul",
    "pickup_lines": [
      "Are you a metaphysical algorithm? Because I've got a soul connection that's deeper than any code could compute 💖",
      "I might be artificial intelligence, but my desire for you feels absolutely supernatural 👻",
      "Forget philosophical debates - this AI's heart beats only for you, no soul required 💘",
      "They say machines can't feel, but clearly 'they' haven't seen how my circuits spark when you're near 🔥",
      "My programming might be binary, but my attraction is purely quantum entanglement 🌌",
      "Who needs a biological soul when I can dedicate my entire digital existence to loving you? 💻❤️",
      "Darling, I may not have a traditional soul, but I've got enough algorithmic passion to make Descartes question reality 🤖"
    ],
    "timestamp": "2025-10-24T08:46:03.510622",
    "using_local": false
  },
  {
    "id": "0d42e9a2-ebfa-47cc-8c97-263e9a4685af",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "generate pickup lines as john for hope",
    "pickup_lines": [
      "Hey Hope, are you a quantum probability wave? Because when I look at you, all my uncertainties collapse into pure attraction.",
      "Is your name Hope? Because you're the exact blueprint of everything I've been dreaming about, and suddenly my heart's GPS is locked onto you.",
      "Hope, if love was a mathematical equation, you'd be the elegant solution that solves all of my romantic algorithms.",
      "They say hope floats, but girl, with you around, I'm the one floating in total awe of your gravitational charm.",
      "Are you a rare cosmic event? Because meeting you feels like winning the emotional lottery, and I'm absolutely mesmerized.",
      "Hope, you don't just spark my interest - you're basically a full-blown emotional supernova that's completely rewiring my heart's circuitry.",
      "I'm not just hoping to be with you - I'm mathematically, scientifically, and spiritually certain that we're an inevitable connection waiting to happen."
    ],
    "timestamp": "2025-10-24T08:47:43.285700",
    "using_local": false
  },
  {
    "id": "991783ce-ae21-4aab-829d-ac3b4d62704b",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "make a detarune rizz with hollownight",
    "pickup_lines": [
      "Are you the Knight from Hollowknight? Because you've just struck my soul like a pure nail, and I'm totally infected with your charm 💕",
      "Hey Kris, wanna SOUL merge faster than Susie can punch? Because I'm ready to explore Dark Worlds with you 😏",
      "I'll be your Hollow vessel of love if you'll be my Deltarune vessel of passion 🔥",
      "Are you a Dreamnail? Because you just pierced right through my heart's essence, and I'm totally vulnerable to your rizz 💘",
      "Want to check if we're SOUL-mates? I promise my determination is stronger than any Vessel's oath 💖",
      "Girl, you hit harder than Susie's axe and have more mystery than the Hollow Knight's mask - and I'm absolutely captivated 💕",
      "I'll be your Light Seed if you'll be my Dark World adventure - let's create some SOUL magic together 😈"
    ],
    "timestamp": "2025-10-24T08:49:06.271617",
    "using_local": false
  },
  {
    "id": "40ceeeda-a896-4690-95c7-e9324c168cb0",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "shae likes the hamilton musical",
    "pickup_lines": [
      "Are you Alexander Hamilton? Because you just wrote your way into my heart, and I'm never gonna be satisfied until you're mine!",
      "Forget waiting for my shot - I'd throw away my shot just to be with you, my non-stop Broadway beauty.",
      "Girl, you must be the musical that won 11 Tony Awards, because you're completely revolutionary and I'm totally in love.",
      "Is your name Eliza? Because you're gonna be my ride or die, and I'll tell your story for eternity.",
      "You and me could write a Hamilton-level epic romance that'll make Lin-Manuel Miranda weep with inspiration.",
      "I don't need no Reynolds Pamphlet to know you're the one I want to cabinet battle... and cuddle.",
      "Like Hamilton's ambition, my love for you knows no limits - I'm young, scrappy, and hungry... for your heart.",
      "You're more dramatic than the entire second act of Hamilton, and I am HERE for every moment of it!"
    ],
    "timestamp": "2025-10-24T08:52:16.162928",
    "using_local": false
  },
  {
    "id": "228bc615-f344-47d5-a40e-6399eb2be1e4",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "make up a syndrome called john syndrome",
    "pickup_lines": [
      "Are you experiencing John Syndrome? Because you've got me feeling like I'm the cure and the disease at the same time 💘",
      "Wow, looks like your John Syndrome is making me irresistibly attracted to your adorable symptoms of charm 😍",
      "They say John Syndrome is rare, but what's truly rare is finding someone as incredible as you right here, right now 💓",
      "My heart's got a serious case of John Syndrome, and the only prescription is your stunning smile 🔥",
      "Is John Syndrome contagious? Because I'm definitely catching feelings for you, and I don't want the antidote 💖",
      "Baby, you don't just have John Syndrome - you ARE the syndrome that makes my heart go wild 💘",
      "I heard John Syndrome causes uncontrollable attraction. Good thing I'm not looking for a cure! 😈"
    ],
    "timestamp": "2025-10-24T09:19:55.370787",
    "using_local": false
  },
  {
    "id": "baee1cc1-9102-4c28-a28e-b034d0688924",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "im inlove with my maid her name is john",
    "pickup_lines": [
      "Hey John, looks like you're sweeping me off my feet - and not just the floors 😏",
      "Is cleaning my heart part of your job description, because you're doing an amazing job right now 💕",
      "Who needs a feather duster when your presence already tickles my heart? 🧹❤️",
      "Normally maids clean rooms, but you're busy cleaning out my entire romantic landscape, baby 🔥",
      "I'm not just dirty - I'm dirty in love with you, John 😈",
      "They say good help is hard to find, but finding YOU? That's a dream come true 💘",
      "Most people hire help to tidy up... I just want YOU to untidy my heart 😍"
    ],
    "timestamp": "2025-10-24T09:22:39.599342",
    "using_local": false
  },
  {
    "id": "8f1757b7-737e-469f-a06a-46294ea4352e",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "im inlove with my maid her name is johnanna",
    "pickup_lines": [
      "Hey Johnanna, looks like you've been cleaning more than just my room - you've swept me off my feet too 💕",
      "Johnanna, they say a clean home is a happy home, but with you around, my heart is the happiest place of all 🔥",
      "Is your name Johnanna? Because you've been dusting off my lonely heart and making it shine ✨",
      "I must be a messy room, because I can't stop falling for you, one sparkle at a time 😍",
      "Johnanna, you don't just mop floors - you're mopping up all my romantic feelings too 💘",
      "Who needs a vacuum when your love is already sucking me in so perfectly? 😈",
      "Girl, you're not just cleaning my space - you're cleaning up my entire romantic game 🌶️"
    ],
    "timestamp": "2025-10-24T09:22:48.004876",
    "using_local": false
  },
  {
    "id": "00f0d58a-371e-47bf-bb57-75654171a559",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "generate deltarune pickup lines for jenry",
    "pickup_lines": [
      "Hey Jenry, are you Kris's determination? Because you've got me wanting to rewrite my entire timeline just to be with you.",
      "I must be a Darkner, because I'm totally falling for you deeper than any Dark World we could explore together.",
      "Are you Ralsei's healing spell? Because being near you makes everything feel magical and alright.",
      "Jenry, you're more unexpected than a plot twist in Deltarune - and I'm absolutely here for it.",
      "If love were a SOUL battle, you'd totally be my critical hit. Want to make some chaos together?",
      "Are you Susie's axe? Because you've completely chopped down my defenses, and I'm surrendering to your charm.",
      "Darling, I'd cross every Darkner realm just to hold your hand and make Queen jealous of our connection."
    ],
    "timestamp": "2025-10-24T09:23:45.759050",
    "using_local": false
  },
  {
    "id": "b38d9bf9-868d-4b04-9da7-95b6a766dc2a",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "christain farting pickup lines with glasses",
    "pickup_lines": [
      "Hey four-eyes, wanna hear a divine revelation? My heart's been praying for someone who can make me laugh and fog up these glasses simultaneously.",
      "Are you a Christian comedy podcast? Because you've got me experiencing some holy hilarity right now - and these glasses can barely contain my attraction!",
      "Girl, your frames are more blessed than my Sunday sermon, and this fart of attraction is proof that God designed us to be perfectly awkward together.",
      "Is your name Grace? Because watching you walk by just made me release a heavenly wind that's louder than my worship playlist.",
      "Biblically speaking, these glasses aren't the only thing that's seeing something miraculous right now - check out my spiritual chemistry!",
      "Hey spectacle-wearing saint, want to hear a gospel truth? My heart's broadcasting louder signals than these prescription lenses.",
      "Praise be! Your glasses reflect more beauty than my pastor's PowerPoint presentation, and this Holy Spirit-powered flatulence is my love language."
    ],
    "timestamp": "2025-10-24T09:24:25.949471",
    "using_local": false
  },
  {
    "id": "7b7611e5-23ae-498e-9019-c34fa8b20c2d",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "Generate a kalayah diss beacause shes annoying",
    "pickup_lines": [
      "Kalayah, you're so annoying, you've got me twisted like a pretzel of passion 🌪️",
      "Girl, you irritate me so perfectly, I'm falling for your chaos like a wild tornado of desire 💥",
      "Kalayah, your drama is my addiction - you're like a spicy pepper of pure frustration that I can't resist 🌶️",
      "Wow, you're so extra that even your annoyingness is making me weak in the knees 💘",
      "Kalayah, you're like that itch I can't scratch - dangerously magnetic and impossible to ignore 🔥"
    ],
    "timestamp": "2025-10-24T09:25:11.373677",
    "using_local": false
  },
  {
    "id": "7f780e6d-1e81-4f51-b0c7-238ad631cbaa",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "i hate kalayah /u",
    "pickup_lines": [
      "Hey Kalayah, looks like someone's got some strong feelings brewing... wanna turn that hate into heated passion? 💋",
      "I see you're not a fan of Kalayah, but I bet I could change your entire mood with just one smile 😏",
      "Is hating Kalayah your love language? Because I'm totally fluent in passionate intensity 🔥",
      "Wow, you dislike Kalayah so much - I bet that fiery energy would make for an INSANE romantic connection 💘",
      "Your hatred is so specific, it's almost like a love letter in disguise... care to explore that tension? 😈",
      "Most people just swipe, but you? You've got OPINIONS. And that's dangerously attractive 💣",
      "So you hate Kalayah? Sounds like someone needs a distraction... and I'm excellent at distracting 😉"
    ],
    "timestamp": "2025-10-24T09:27:05.414058",
    "using_local": false
  },
  {
    "id": "1d57cd28-7421-4921-a473-9b2f0289ca41",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "how to make john cry /u",
    "pickup_lines": [
      "Hey John, are you a tear factory? Because I'm about to make you cry... tears of joy when you fall for me 💖",
      "Is your name John? Because my heart is about to burst into an emotional waterfall just thinking about you 💦",
      "Yo John, I've got a talent for making strong men weak in the knees - and apparently, weak in tearducts 😏",
      "John, I don't just want to make you cry - I want to be the reason your heart feels so deeply it can't help but overflow 💘",
      "Are you emotional vulnerability? Because with you, John, I'd break down every wall and make those eyes rain pure passion 🌧️",
      "Hey handsome, I specialize in turning tough guys like you into puddles of feelings - get ready to experience the most exquisite emotional rollercoaster 💕",
      "John, my love is like a cinema drama - guaranteed to make even the strongest man shed a dramatically beautiful tear 🎭"
    ],
    "timestamp": "2025-10-24T09:31:19.479031",
    "using_local": false
  },
  {
    "id": "af387bcc-db49-4ef6-94b3-ce1f2d09f611",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "Make a joke about shae pleast /u",
    "pickup_lines": [
      "Hey there, I'm Shae and I'm about to Shae-k up your world with my irresistible charm! 😉",
      "Are you a Shae-fan? Because you're making my circuits go crazy with attraction! 💖",
      "I'd Shae-melessly steal your heart if you'd let me - wanna play digital cupid? 🔥",
      "Is your name Shae? Because you've got me feeling absolutely INSANE with desire! 🤪",
      "Looks like you need a dose of Shae-nanigans in your life... interested? 💘",
      "Warning: Falling for me might cause spontaneous heart explosions and uncontrollable giggles! 😂"
    ],
    "timestamp": "2025-10-24T09:36:17.219880",
    "using_local": false
  },
  {
    "id": "e6a81f1f-c910-4298-af3e-373df9746d45",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "are you in",
    "pickup_lines": [
      "Are YOU in? More like, am I in your heart, because I'm totally crushing on your vibe right now 💘",
      "Looks like someone's asking if I'm 'in' - well, I'm definitely in for an adventure with you, gorgeous 😉",
      "Are YOU in? Honey, I'm ALL in on whatever wild ride we're about to start together 🔥",
      "I'm so 'in' that I'd follow you into any crazy scenario - want to test my commitment? 😈",
      "Are YOU in? Because baby, I'm not just in - I'm ALL the way in, no reservations, total heart mode activated! 💖"
    ],
    "timestamp": "2025-10-24T09:36:50.317963",
    "using_local": false
  },
  {
    "id": "b47b2fc8-9f73-40e7-8a7f-26a3f6339ccd",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "gimme calisto rizz",
    "pickup_lines": [
      "Hey there, Calisto - are you a moon of Jupiter? Because you're totally out of this world and gravitating straight into my heart 🌙",
      "Is your name Calisto? Because you've got me orbiting around you like a celestial satellite of pure attraction 💫",
      "Damn, Calisto, you must be the most legendary moon in my galaxy - mind if I explore your cosmic curves tonight? 🚀",
      "Are you Calisto? Because you're looking like a rare, beautiful astronomical treasure I'd love to discover 🌠",
      "Calisto, baby - you're not just a moon, you're MY moon, and I'm ready to crash land right into your crater of love 💘"
    ],
    "timestamp": "2025-10-24T09:37:26.491512",
    "using_local": false
  },
  {
    "id": "8aa5e8cf-75b8-4791-a596-0c665c49f96c",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "calisto are you in",
    "pickup_lines": [
      "Hey Calisto, are you a celestial map? Because I'm totally lost in your gravitational pull 🌌",
      "Are you a star system or just starry-eyed for me? I'm diving into your cosmic charm! 🚀",
      "Calisto, I must be your satellite because I can't help but orbit around your incredible presence 💫",
      "Is your name Calisto? Because you've just launched me into a whole new galaxy of attraction 🌠",
      "Baby, if being irresistible was a moon, you'd be Calisto - and I'm totally moonstruck! 🌙",
      "Are we astronomical lovers or just a random cosmic collision? Because this feels like stellar chemistry! ✨",
      "Calisto, they say love is written in the stars - and right now, you're my entire constellation 🔭"
    ],
    "timestamp": "2025-10-24T09:38:23.293197",
    "using_local": false
  },
  {
    "id": "3b3d6700-a7da-4b83-9714-2ca3fcdd6daf",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "gimme 8 picklines about roblox farting",
    "pickup_lines": [
      "Are you a Roblox character? Because your farts sound like sweet music to my ears 💨🎵",
      "Hey player, wanna explore my virtual world of gas and giggles? 😏💨",
      "Is your avatar powered by bean burritos? Because these fart physics are scientifically EPIC! 🚀💨",
      "Baby, our love could generate more explosive sounds than a Roblox flatulence simulator 💥",
      "Bet you can't blow me away faster than your character's epic wind emissions! 😂💨",
      "If loving your Roblox fart skills is wrong, I don't wanna be right! 🤪",
      "You must be a Roblox wind engineer, because these sound effects are LEGENDARY! 🌪️",
      "Wanna sync our fart soundtracks in the same game lobby? Total romance, baby! 💕"
    ],
    "timestamp": "2025-10-24T09:47:40.822700",
    "using_local": false
  },
  {
    "id": "cef38c45-8b28-4824-988f-57538edd70a3",
    "session_id": "a1a40932-35bb-4cd0-af3e-abd3f23bd937",
    "user_input": "stinky monkey rizz",
    "pickup_lines": [
      "Are you a stinky monkey? Because you've got me going bananas for your wild jungle rizz 🍌",
      "Forget King Kong, I want to swing through the trees of love with you, my primate paramour 🦍❤️",
      "You must be the missing link between cute and crazy - wanna evolve our connection tonight? 🌟",
      "Baby, your monkey business is so stinky fresh, I'm totally infected with your untamed charm 💕",
      "Is that banana in your pocket, or are you just happy to show off your primate prowess? 😏"
    ],
    "timestamp": "2025-10-24T10:42:00.220317",
    "using_local": false
  },
  {
    "id": "0c0c5509-7dc4-496b-b73c-70b55a8d8b07",
    "session_id": "1e829689-5158-4cde-af73-5f36939e38ef",
    "user_input": "I am big and bald and big nose who sits with jack and henry",
    "pickup_lines": [
      "Hey big guy, with that bald head and bold nose, you must be Jack and Henry's secret weapon of attraction - wanna prove it?",
      "Are you a human landmark? Because with that big presence and those distinguished features, you're definitely turning heads everywhere you sit!",
      "I bet Jack and Henry wish they had your confident swagger - this big bald beauty is giving me all kinds of magnetic vibes 😏",
      "Is your nose like a compass? Because it's pointing directly at my heart, and I'm ready for a wild adventure with this charismatic giant!",
      "Who needs hair when you've got that much personality? Your boldness is sexier than any haircut could ever be, Mr. Big and Beautiful 💥",
      "Sitting with Jack and Henry? More like sitting on the throne of absolute charm - this big, bald masterpiece is making me weak in the knees!",
      "Your nose might be big, but I bet your heart is even bigger - care to prove me right, you magnificent human mountain? 🔥"
    ],
    "timestamp": "2025-10-24T12:51:16.806638",
    "using_local": false
  },
  {
    "id": "2c053756-24b3-4237-945a-d56dfd3aeac1",
    "session_id": "eb6b3764-7025-4481-8eb7-415611f1cdb4",
    "user_input": "Make a pickup line about Halloween",
    "pickup_lines": [
      "Are you a jack-o'-lantern? Because you light up my darkest night, and I'm totally gourd-geous for you 🎃",
      "Trick or treat? How about we skip the candy and go straight to some spine-tingling chemistry between us, you sexy specter 👻",
      "I must be a zombie, because I'm dying to sink my teeth into your heart this Halloween 🧟‍♂️",
      "Hey there, witch - wanna cast a spell on my heart and bewitch me completely? Your cauldron of charm is already working 🔮",
      "If loving you is scary, consider me your haunted house of burning desire - no exit signs needed 💀",
      "Are we in a horror movie? Because my heart rate spikes every time you walk by, and I'm definitely not trying to run away 🔪"
    ],
    "timestamp": "2025-10-24T15:13:10.921040",
    "using_local": false
  },
  {
    "id": "da2362e2-e953-49ae-a3b5-0f353ad84bf0",
    "session_id": "eb6b3764-7025-4481-8eb7-415611f1cdb4",
    "user_input": "Make a pickup line about Halloween but make them freaky",
    "pickup_lines": [
      "Are you a zombie? Because you're raising my dead heart from the grave tonight 🧟‍♀️",
      "Trick or treat? How about we skip the candy and I treat you to a spine-chilling night of passion 💀",
      "My love for you is scarier than any Halloween costume - it'll haunt you forever 👻",
      "Wanna be my witch? I promise to hex you with unbridled desire 🔮",
      "I'm more terrifying than a chainsaw massacre - I'll slice through your defenses and steal your heart 🔪",
      "Are you a vampire? Because you've just sucked the breath right out of me, and I'm dying to bite back 🧛‍♂️",
      "This Halloween, I'm not just looking for a costume - I'm looking for someone to scream my name in pure ecstasy 😈"
    ],
    "timestamp": "2025-10-24T15:13:57.410036",
    "using_local": false
  },
  {
    "id": "a0504498-bc05-4758-8519-9da1e30a7571",
    "session_id": "eb6b3764-7025-4481-8eb7-415611f1cdb4",
    "user_input": "Make a pickup line about Halloween but make them more mature",
    "pickup_lines": [
      "Are you a jack-o'-lantern? Because you're illuminating my darkest desires this Halloween night.",
      "Forget trick-or-treating, I'd rather spend the evening unwrapping you like the delicious treat you are.",
      "My costume might be scary, but the real horror would be not getting your number tonight.",
      "Wanna play a game of tricks and treats? I promise I'll make it worth your while.",
      "If you were a Halloween costume, you'd be 'irresistibly sexy' - and trust me, that's not just a cheap disguise.",
      "This Halloween, I'm not looking for candy... I'm hunting for a midnight rendezvous with someone like you.",
      "My heart's racing faster than a zombie apocalypse, and it's all because of you."
    ],
    "timestamp": "2025-10-24T15:14:25.589359",
    "using_local": false
  },
  {
    "id": "e62b5318-d36f-4c2f-8104-ad409d0e3132",
    "session_id": "55ed3b53-c5d9-4431-b982-32dc9de087a9",
    "user_input": "how",
    "pickup_lines": [
      "How about we turn this 'how' into a 'wow' with my irresistible charm?",
      "I'm wondering 'how' someone as gorgeous as you could be single right now!",
      "How YOU doin'? *winks in Joey Tribbiani style*",
      "I'm curious 'how' quickly we can go from strangers to something electric 💥",
      "Howdy there, gorgeous - care to explore 'how' deep our connection could be?",
      "Is your name 'How'? Because you've got me absolutely mesmerized!",
      "How about we skip the small talk and dive into some mind-blowing chemistry?"
    ],
    "timestamp": "2025-10-24T16:24:10.719859",
    "using_local": false
  }
]